{
  "SPDXID": "SPDXRef-DOCUMENT",
  "spdxVersion": "SPDX-2.3",
  "creationInfo": {
    "created": "2025-08-04T04:44:03Z",
    "creators": [
      "Organization: NXP"
    ],
    "licenseListVersion": "3.20"
  },
  "name": "mcux-component-v25.09.00-pvw2",
  "dataLicense": "CC0-1.0",
  "hasExtractedLicensingInfos": [
    {
      "licenseId": "LicenseRef-3eca8fb9-fca4-4b49-b4bd-189ba8efd691",
      "extractedText": "NONE",
      "name": "Basic Proprietary Commercial License"
    },
    {
      "licenseId": "LicenseRef-68ae68ac-8cc8-4eaf-a7f4-998c2194f58d",
      "extractedText": "Segger J-Link Drivers License\nVersion 210702\n\nImportant - Read carefully:\n\nDEFINITIONS:\nFor the purpose of this agreement, the terms shall have the following meaning when the entire word is marked bold:\n\nThe SOFTWARE means all J-Link / Flasher related software components included in the J-Link software & documentation pack as well as the Flasher software & documentation pack provided by SEGGER which can be downloaded at: https://www.segger.com/downloads/jlink and https://www.segger.com/downloads/flasher\n\n\"Licensor\" shall mean SEGGER except under the following circumstances:\nIf Licensee acquired the SOFTWARE as a bundled component of a third party product or service, then such third party shall either include this license terms or be Licensor and provide similar terms which will not exceed those set forth in this agreement.\n\n1. LICENSE AGREEMENT\nThis license is a legal agreement between YOU (either an individual or a single entity) and SEGGER Microcontroller GmbH (called SEGGER).\nBy downloading the SOFTWARE, you agree to be bound by the terms of this agreement.\n\n2. LICENSE GRANT\nThe SOFTWARE consists of proprietary, unpublished products of SEGGER, protected under copyright and trade secret laws.\nAll rights, title and interest in the SOFTWARE are and shall remain with SEGGER.\nLicensor grants Licensee a non-exclusive and non-transferable License to use the SOFTWARE or parts thereof with SEGGERs J-Link family of debug probes or authorized OEM products and SEGGERs Flasher family of programmers only.  Additional info on the original SEGGER J-Link family of debug probes, SEGGER Flasher family of programmers or authorized OEM products can be obtained at: http://www.segger.com/terms-of-use.html.  Any other use of the SOFTWARE is prohibited without prior written authorization from SEGGER.\nThe use of the licensed SOFTWARE to operate clones is prohibited and illegal; SEGGER may hold Licensee liable, if Licensee fails to comply with this restriction.\nAny (re)distribution or shipment of the SOFTWARE requires the prior written authorization from SEGGER in each instance.\nLicensee is entitled to make copies of the SOFTWARE for backup purposes only.\nAll copies of the SOFTWARE, including modifications to the SOFTWARE, must bear all copyright, trademarks and other proprietary notices included thereon by SEGGER.\nThis License does not entitle Licensee to receive from SEGGER hard-copy documentation, technical support, telephone assistance, or enhancements or updates for the SOFTWARE unless a specific agreement clearly states otherwise.\n\n3. RESTRICTIONS\nLicensee may not:\n(a) decompile, disassemble, reverse engineer, or otherwise attempt to derive the source code of the SOFTWARE,\n(b) redistribute, encumber, sell, rent, lease, sublicense, or otherwise transfer rights of the SOFTWARE,\n(c) remove or alter any trademark, logo, copyright or other proprietary notices, legends, symbols or labels of the SOFTWARE,\n(d) install or use the SOFTWARE with unauthorized debug probes and programmers,\n(e) use the J-link OB technology for any production purposes.\n\n4. FEES, ADDITIONAL LICENSE TERMS FOR FLASHER SECURE\nAll features of the SOFTWARE which are functional without request for a license key can be used free of charge, at least for evaluation purposes. Additional license terms and fees may apply to SEGGER Flasher Secure software components. \n\n5. TERMINATION\nWithout prejudice to any other rights, Licensor may terminate this agreement if Licensee breaches any term or condition of this agreement. In such event SEGGER is entitled to also claim monetary damages.\n\n6. PROPRIETARY RIGHTS\nTitle, ownership rights, and intellectual property rights in the SOFTWARE shall remain by SEGGER and/or its suppliers. Licensee acknowledges such ownership and intellectual property rights and will not take any action to jeopardize, limit or interfere in any manner with SEGGER or its suppliers' ownership of or rights with respect to the SOFTWARE. The SOFTWARE is protected by copyright and other intellectual property laws and by international treaties.\n\n7. DISCLAIMER OF WARRANTY\nThe SOFTWARE is provided on an \"as is\" basis, without warranty of any kind, including without limitation the warranties that it is free of defects, merchantable, fit for a particular purpose or non-infringing. The entire risk as to the quality and performance of the SOFTWARE is borne by Licensee. Should the SOFTWARE prove defective in any respect, Licensee and not Licensor or its suppliers or resellers assumes the entire cost of any service and repair. In addition Licensee must determine that the SOFTWARE sufficiently meets its requirements. This disclaimer of warranty constitutes an essential part of this agreement. No use of the SOFTWARE is authorized hereunder except under this disclaimer.\n\n8. LIMITATION OF LIABILITY\nTo the maximum extent permitted by applicable law, in no event will Licensor or its suppliers or resellers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the SOFTWARE, including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof, and regardless of the legal or equitable theory (contract, tort or otherwise) upon which the claim is based. In any case, Licensor's entire liability under any provision of this agreement shall not exceed in the aggregate the sum of the fees Licensee paid for this license (if any), with the exception of death or personal injury caused by the negligence of Licensor to the extent applicable law prohibits the limitation of damages in such cases. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not be applicable. SEGGER is not responsible for any liability arising out of content provided by Licensee or a third party that is accessed through the product and/or any material linked through such content.\n\n9. HIGH RISK ACTIVITIES\nThe SOFTWARE is not designed for use in hazardous environments requiring fail-safe performance, such as in the operation of nuclear facilities, aircraft navigation or communication systems, air traffic control, direct life support machines, or weapons systems, in which the failure of the SOFTWARE could lead directly to death, personal injury, or severe physical or environmental damage (\"High Risk Activities\"). Accordingly, Licensor and its suppliers specifically disclaim any express or implied warranty of fitness for High Risk Activities.\n\n10. MISCELLANEOUS\n(a) This agreement constitutes the entire agreement between the parties concerning the subject matter hereof.\n(b) This agreement may be changed only by an amendment in writing, signed by both parties.\n(c) If any provision in this agreement should be held illegal or unenforceable by a court having jurisdiction, such provision shall be modified to the extent necessary to render it enforceable without losing its intent, or severed from this agreement if no such modification is possible, and other provisions of this agreement shall remain in full force and effect.\n(d) This agreement shall be governed by the laws of the Federal Republic of Germany.\n(e) This agreement shall be binding upon and shall inure to the benefit of the parties, their successors and permitted assigns.\n(f) Neither party shall be in default or be liable for any delay, failure in performance or interruption of service resulting directly or indirectly from any cause beyond its reasonable control.\n(g) If any SEGGER professional services are being provided, then such professional services are provided pursuant to the terms of a separate professional services agreement between the parties. The parties acknowledge that such services are acquired independently of the SOFTWARE licensed hereunder.\n\nCopyright (c) 2004-2021 SEGGER Microcontroller GmbH\n\nAdditional Software\n\nSome applications in this package dynamically link against Qt4 (4.8.7) libraries distributed under the Lesser GNU General Public License version 2.1 (LGPLv21).\nThe affected applications make notice about Qt usage in their \"About\" dialog.\nThere is also an exception added by Qt to the LGPLv21 license. In the following, the LGPLv21 as well as the exception added by Qt is shown.\n\n            GNU LESSER GENERAL PUBLIC LICENSE\n\n The Qt Toolkit is Copyright (C) 2015 The Qt Company Ltd.\n Contact: http://www.qt.io/licensing/\n\n You may use, distribute and copy the Qt GUI Toolkit under the terms of\n GNU Lesser General Public License version 2.1, which is displayed below.\n\n-------------------------------------------------------------------------\n\n            GNU LESSER GENERAL PUBLIC LICENSE\n                Version 2.1, February 1999\n\n Copyright (C) 1991, 1999 Free Software Foundation, Inc.\n 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n[This is the first released version of the Lesser GPL.  It also counts\n as the successor of the GNU Library Public License, version 2, hence\n the version number 2.1.]\n\n Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicenses are intended to guarantee your freedom to share and change\nfree software--to make sure the software is free for all its users.\n\n  This license, the Lesser General Public License, applies to some\nspecially designated software packages--typically libraries--of the\nFree Software Foundation and other authors who decide to use it.  You\ncan use it too, but we suggest you first think carefully about whether\nthis license or the ordinary General Public License is the better\nstrategy to use in any particular case, based on the explanations below.\n\n  When we speak of free software, we are referring to freedom of use,\nnot price.  Our General Public Licenses are designed to make sure that\nyou have the freedom to distribute copies of free software (and charge\nfor this service if you wish); that you receive source code or can get\nit if you want it; that you can change the software and use pieces of\nit in new free programs; and that you are informed that you can do\nthese things.\n\n  To protect your rights, we need to make restrictions that forbid\ndistributors to deny you these rights or to ask you to surrender these\nrights.  These restrictions translate to certain responsibilities for\nyou if you distribute copies of the library or if you modify it.\n\n  For example, if you distribute copies of the library, whether gratis\nor for a fee, you must give the recipients all the rights that we gave\nyou.  You must make sure that they, too, receive or can get the source\ncode.  If you link other code with the library, you must provide\ncomplete object files to the recipients, so that they can relink them\nwith the library after making changes to the library and recompiling\nit.  And you must show them these terms so they know their rights.\n\n  We protect your rights with a two-step method: (1) we copyright the\nlibrary, and (2) we offer you this license, which gives you legal\npermission to copy, distribute and/or modify the library.\n\n  To protect each distributor, we want to make it very clear that\nthere is no warranty for the free library.  Also, if the library is\nmodified by someone else and passed on, the recipients should know\nthat what they have is not the original version, so that the original\nauthor's reputation will not be affected by problems that might be\nintroduced by others.\n\n  Finally, software patents pose a constant threat to the existence of\nany free program.  We wish to make sure that a company cannot\neffectively restrict the users of a free program by obtaining a\nrestrictive license from a patent holder.  Therefore, we insist that\nany patent license obtained for a version of the library must be\nconsistent with the full freedom of use specified in this license.\n\n  Most GNU software, including some libraries, is covered by the\nordinary GNU General Public License.  This license, the GNU Lesser\nGeneral Public License, applies to certain designated libraries, and\nis quite different from the ordinary General Public License.  We use\nthis license for certain libraries in order to permit linking those\nlibraries into non-free programs.\n\n  When a program is linked with a library, whether statically or using\na shared library, the combination of the two is legally speaking a\ncombined work, a derivative of the original library.  The ordinary\nGeneral Public License therefore permits such linking only if the\nentire combination fits its criteria of freedom.  The Lesser General\nPublic License permits more lax criteria for linking other code with\nthe library.\n\n  We call this license the \"Lesser\" General Public License because it\ndoes Less to protect the user's freedom than the ordinary General\nPublic License.  It also provides other free software developers Less\nof an advantage over competing non-free programs.  These disadvantages\nare the reason we use the ordinary General Public License for many\nlibraries.  However, the Lesser license provides advantages in certain\nspecial circumstances.\n\n  For example, on rare occasions, there may be a special need to\nencourage the widest possible use of a certain library, so that it becomes\na de-facto standard.  To achieve this, non-free programs must be\nallowed to use the library.  A more frequent case is that a free\nlibrary does the same job as widely used non-free libraries.  In this\ncase, there is little to gain by limiting the free library to free\nsoftware only, so we use the Lesser General Public License.\n\n  In other cases, permission to use a particular library in non-free\nprograms enables a greater number of people to use a large body of\nfree software.  For example, permission to use the GNU C Library in\nnon-free programs enables many more people to use the whole GNU\noperating system, as well as its variant, the GNU/Linux operating\nsystem.\n\n  Although the Lesser General Public License is Less protective of the\nusers' freedom, it does ensure that the user of a program that is\nlinked with the Library has the freedom and the wherewithal to run\nthat program using a modified version of the Library.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.  Pay close attention to the difference between a\n\"work based on the library\" and a \"work that uses the library\".  The\nformer contains code derived from the library, whereas the latter must\nbe combined with the library in order to run.\n\n        GNU LESSER GENERAL PUBLIC LICENSE\n    TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License Agreement applies to any software library or other\nprogram which contains a notice placed by the copyright holder or\nother authorized party saying it may be distributed under the terms of\nthis Lesser General Public License (also called \"this License\").\nEach licensee is addressed as \"you\".\n\n  A \"library\" means a collection of software functions and/or data\nprepared so as to be conveniently linked with application programs\n(which use some of those functions and data) to form executables.\n\n  The \"Library\", below, refers to any such software library or work\nwhich has been distributed under these terms.  A \"work based on the\nLibrary\" means either the Library or any derivative work under\ncopyright law: that is to say, a work containing the Library or a\nportion of it, either verbatim or with modifications and/or translated\nstraightforwardly into another language.  (Hereinafter, translation is\nincluded without limitation in the term \"modification\".)\n\n  \"Source code\" for a work means the preferred form of the work for\nmaking modifications to it.  For a library, complete source code means\nall the source code for all modules it contains, plus any associated\ninterface definition files, plus the scripts used to control compilation\nand installation of the library.\n\n  Activities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning a program using the Library is not restricted, and output from\nsuch a program is covered only if its contents constitute a work based\non the Library (independent of the use of the Library in a tool for\nwriting it).  Whether that is true depends on what the Library does\nand what the program that uses the Library does.\n\n  1. You may copy and distribute verbatim copies of the Library's\ncomplete source code as you receive it, in any medium, provided that\nyou conspicuously and appropriately publish on each copy an\nappropriate copyright notice and disclaimer of warranty; keep intact\nall the notices that refer to this License and to the absence of any\nwarranty; and distribute a copy of this License along with the\nLibrary.\n\n  You may charge a fee for the physical act of transferring a copy,\nand you may at your option offer warranty protection in exchange for a\nfee.\n\n  2. You may modify your copy or copies of the Library or any portion\nof it, thus forming a work based on the Library, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) The modified work must itself be a software library.\n\n    b) You must cause the files modified to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    c) You must cause the whole of the work to be licensed at no\n    charge to all third parties under the terms of this License.\n\n    d) If a facility in the modified Library refers to a function or a\n    table of data to be supplied by an application program that uses\n    the facility, other than as an argument passed when the facility\n    is invoked, then you must make a good faith effort to ensure that,\n    in the event an application does not supply such function or\n    table, the facility still operates, and performs whatever part of\n    its purpose remains meaningful.\n\n    (For example, a function in a library to compute square roots has\n    a purpose that is entirely well-defined independent of the\n    application.  Therefore, Subsection 2d requires that any\n    application-supplied function or table used by this function must\n    be optional: if the application does not supply it, the square\n    root function must still compute square roots.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Library,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Library, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote\nit.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Library.\n\nIn addition, mere aggregation of another work not based on the Library\nwith the Library (or with a work based on the Library) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may opt to apply the terms of the ordinary GNU General Public\nLicense instead of this License to a given copy of the Library.  To do\nthis, you must alter all the notices that refer to this License, so\nthat they refer to the ordinary GNU General Public License, version 2,\ninstead of to this License.  (If a newer version than version 2 of the\nordinary GNU General Public License has appeared, then you can specify\nthat version instead if you wish.)  Do not make any other change in\nthese notices.\n\n  Once this change is made in a given copy, it is irreversible for\nthat copy, so the ordinary GNU General Public License applies to all\nsubsequent copies and derivative works made from that copy.\n\n  This option is useful when you wish to copy part of the code of\nthe Library into a program that is not a library.\n\n  4. You may copy and distribute the Library (or a portion or\nderivative of it, under Section 2) in object code or executable form\nunder the terms of Sections 1 and 2 above provided that you accompany\nit with the complete corresponding machine-readable source code, which\nmust be distributed under the terms of Sections 1 and 2 above on a\nmedium customarily used for software interchange.\n\n  If distribution of object code is made by offering access to copy\nfrom a designated place, then offering equivalent access to copy the\nsource code from the same place satisfies the requirement to\ndistribute the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  5. A program that contains no derivative of any portion of the\nLibrary, but is designed to work with the Library by being compiled or\nlinked with it, is called a \"work that uses the Library\".  Such a\nwork, in isolation, is not a derivative work of the Library, and\ntherefore falls outside the scope of this License.\n\n  However, linking a \"work that uses the Library\" with the Library\ncreates an executable that is a derivative of the Library (because it\ncontains portions of the Library), rather than a \"work that uses the\nlibrary\".  The executable is therefore covered by this License.\nSection 6 states terms for distribution of such executables.\n\n  When a \"work that uses the Library\" uses material from a header file\nthat is part of the Library, the object code for the work may be a\nderivative work of the Library even though the source code is not.\nWhether this is true is especially significant if the work can be\nlinked without the Library, or if the work is itself a library.  The\nthreshold for this to be true is not precisely defined by law.\n\n  If such an object file uses only numerical parameters, data\nstructure layouts and accessors, and small macros and small inline\nfunctions (ten lines or less in length), then the use of the object\nfile is unrestricted, regardless of whether it is legally a derivative\nwork.  (Executables containing this object code plus portions of the\nLibrary will still fall under Section 6.)\n\n  Otherwise, if the work is a derivative of the Library, you may\ndistribute the object code for the work under the terms of Section 6.\nAny executables containing that work also fall under Section 6,\nwhether or not they are linked directly with the Library itself.\n\n  6. As an exception to the Sections above, you may also combine or\nlink a \"work that uses the Library\" with the Library to produce a\nwork containing portions of the Library, and distribute that work\nunder terms of your choice, provided that the terms permit\nmodification of the work for the customer's own use and reverse\nengineering for debugging such modifications.\n\n  You must give prominent notice with each copy of the work that the\nLibrary is used in it and that the Library and its use are covered by\nthis License.  You must supply a copy of this License.  If the work\nduring execution displays copyright notices, you must include the\ncopyright notice for the Library among them, as well as a reference\ndirecting the user to the copy of this License.  Also, you must do one\nof these things:\n\n    a) Accompany the work with the complete corresponding\n    machine-readable source code for the Library including whatever\n    changes were used in the work (which must be distributed under\n    Sections 1 and 2 above); and, if the work is an executable linked\n    with the Library, with the complete machine-readable \"work that\n    uses the Library\", as object code and/or source code, so that the\n    user can modify the Library and then relink to produce a modified\n    executable containing the modified Library.  (It is understood\n    that the user who changes the contents of definitions files in the\n    Library will not necessarily be able to recompile the application\n    to use the modified definitions.)\n\n    b) Use a suitable shared library mechanism for linking with the\n    Library.  A suitable mechanism is one that (1) uses at run time a\n    copy of the library already present on the user's computer system,\n    rather than copying library functions into the executable, and (2)\n    will operate properly with a modified version of the library, if\n    the user installs one, as long as the modified version is\n    interface-compatible with the version that the work was made with.\n\n    c) Accompany the work with a written offer, valid for at\n    least three years, to give the same user the materials\n    specified in Subsection 6a, above, for a charge no more\n    than the cost of performing this distribution.\n\n    d) If distribution of the work is made by offering access to copy\n    from a designated place, offer equivalent access to copy the above\n    specified materials from the same place.\n\n    e) Verify that the user has already received a copy of these\n    materials or that you have already sent this user a copy.\n\n  For an executable, the required form of the \"work that uses the\nLibrary\" must include any data and utility programs needed for\nreproducing the executable from it.  However, as a special exception,\nthe materials to be distributed need not include anything that is\nnormally distributed (in either source or binary form) with the major\ncomponents (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, unless that component itself accompanies\nthe executable.\n\n  It may happen that this requirement contradicts the license\nrestrictions of other proprietary libraries that do not normally\naccompany the operating system.  Such a contradiction means you cannot\nuse both them and the Library together in an executable that you\ndistribute.\n\n  7. You may place library facilities that are a work based on the\nLibrary side-by-side in a single library together with other library\nfacilities not covered by this License, and distribute such a combined\nlibrary, provided that the separate distribution of the work based on\nthe Library and of the other library facilities is otherwise\npermitted, and provided that you do these two things:\n\n    a) Accompany the combined library with a copy of the same work\n    based on the Library, uncombined with any other library\n    facilities.  This must be distributed under the terms of the\n    Sections above.\n\n    b) Give prominent notice with the combined library of the fact\n    that part of it is a work based on the Library, and explaining\n    where to find the accompanying uncombined form of the same work.\n\n  8. You may not copy, modify, sublicense, link with, or distribute\nthe Library except as expressly provided under this License.  Any\nattempt otherwise to copy, modify, sublicense, link with, or\ndistribute the Library is void, and will automatically terminate your\nrights under this License.  However, parties who have received copies,\nor rights, from you under this License will not have their licenses\nterminated so long as such parties remain in full compliance.\n\n  9. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Library or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Library (or any work based on the\nLibrary), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Library or works based on it.\n\n  10. Each time you redistribute the Library (or any work based on the\nLibrary), the recipient automatically receives a license from the\noriginal licensor to copy, distribute, link with or modify the Library\nsubject to these terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties with\nthis License.\n\n  11. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Library at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Library by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply,\nand the section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  12. If the distribution and/or use of the Library is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Library under this License may add\nan explicit geographical distribution limitation excluding those countries,\nso that distribution is permitted only in or among countries not thus\nexcluded.  In such case, this License incorporates the limitation as if\nwritten in the body of this License.\n\n  13. The Free Software Foundation may publish revised and/or new\nversions of the Lesser General Public License from time to time.\nSuch new versions will be similar in spirit to the present version,\nbut may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Library\nspecifies a version number of this License which applies to it and\n\"any later version\", you have the option of following the terms and\nconditions either of that version or of any later version published by\nthe Free Software Foundation.  If the Library does not specify a\nlicense version number, you may choose any version ever published by\nthe Free Software Foundation.\n\n  14. If you wish to incorporate parts of the Library into other free\nprograms whose distribution conditions are incompatible with these,\nwrite to the author to ask for permission.  For software which is\ncopyrighted by the Free Software Foundation, write to the Free\nSoftware Foundation; we sometimes make exceptions for this.  Our\ndecision will be guided by the two goals of preserving the free status\nof all derivatives of our free software and of promoting the sharing\nand reuse of software generally.\n\n                NO WARRANTY\n\n  15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO\nWARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR\nOTHER PARTIES PROVIDE THE LIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nLIBRARY IS WITH YOU.  SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY\nAND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU\nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nLIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\n                END OF TERMS AND CONDITIONS\n\n           How to Apply These Terms to Your New Libraries\n\n  If you develop a new library, and you want it to be of the greatest\npossible use to the public, we recommend making it free software that\neveryone can redistribute and change.  You can do so by permitting\nredistribution under these terms (or, alternatively, under the terms of the\nordinary General Public License).\n\n  To apply these terms, attach the following notices to the library.  It is\nsafest to attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least the\n\"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the library's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This library is free software; you can redistribute it and/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 2.1 of the License, or (at your option) any later version.\n\n    This library is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    Lesser General Public License for more details.\n\n    You should have received a copy of the GNU Lesser General Public\n    License along with this library; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n\nAlso add information on how to contact you by electronic and paper mail.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the library, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the\n  library `Frob' (a library for tweaking knobs) written by James Random Hacker.\n\n  <signature of Ty Coon>, 1 April 1990\n  Ty Coon, President of Vice\n\nThat's all there is to it!\n\n\nDigia Qt LGPL Exception version 1.1\n\nAs an additional permission to the GNU Lesser General Public License version\n2.1, the object code form of a \"work that uses the Library\" may incorporate\nmaterial from a header file that is part of the Library.  You may distribute\nsuch object code under terms of your choice, provided that:\n    (i)   the header files of the Library have not been modified; and\n    (ii)  the incorporated material is limited to numerical parameters, data\n          structure layouts, accessors, macros, inline functions and\n          templates; and\n    (iii) you comply with the terms of Section 6 of the GNU Lesser General\n          Public License version 2.1.\n\nMoreover, you may apply this exception to a modified version of the Library,\nprovided that such modification does not involve copying material from the\nLibrary into the modified Library's header files unless such material is\nlimited to (i) numerical parameters; (ii) data structure layouts;\n(iii) accessors; and (iv) small macros, templates and inline functions of\nfive lines or less in length.\n\nFurthermore, you are not required to apply this additional permission to a\nmodified version of the Library.\n",
      "name": "Segger J-Link Drivers License"
    },
    {
      "licenseId": "LicenseRef-b99d132e-c7cd-453d-9fd8-f47eed9b7670",
      "extractedText": "Copyright (c) 2019 - Present, Memfault\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code or in binary form must reproduce\nthe above copyright notice, this list of conditions and the following\ndisclaimer in the documentation and/or other materials provided with the\ndistribution.\n\n2. Neither the name of Memfault nor the names of its contributors may be\nused to endorse or promote products derived from this software without\nspecific prior written permission.\n\n3. This software, with or without modification, must only be used with\nthe Memfault services and integrated with the Memfault server.\n\n4. Any software provided in binary form under this license must not be\nreverse engineered, decompiled, modified and/or disassembled.\n\nTHIS SOFTWARE IS PROVIDED BY MEMFAULT \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\nNONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\nSHALL MEMFAULT OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\nOR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGE.",
      "name": "Memfault License"
    },
    {
      "licenseId": "LicenseRef-bf9973bb-8090-4f76-adea-710fd5e3efbc",
      "extractedText": "LA_OPT_Online Code Hosting NXP_Software_License - v1.2 October 2023 \nIMPORTANT.  Read the following NXP Online Code Hosting Software License Agreement (“Agreement”) completely. By selecting the “I Accept” button at the end of this page, or by downloading, installing, or using the Licensed Software, including via GitHub or similar platform, you indicate that you accept the terms of the Agreement, and you acknowledge that you have the authority, for yourself or on behalf of your company, to bind your company to these terms. You may then download or install the software or obtain it via GitHub or similar platform. In the event of a conflict between the terms of this Agreement and any license terms and conditions for NXP’s proprietary software embedded anywhere in the Licensed Software file, the terms of this Agreement shall control.  If a separate license agreement for the Licensed Software has been signed by you and NXP, then that agreement shall govern your use of the Licensed Software and shall supersede this Agreement. \n\nNXP ONLINE CODE HOSTING SOFTWARE LICENSE AGREEMENT\nThis is a legal agreement between your employer, of which you are an authorized representative, or, if you have no employer, you as an individual (“you” or “Licensee”), and NXP B.V. (“NXP”).  It concerns your rights to use the software provided to you in binary or source code form and any accompanying written materials (the “Licensed Software”). The Licensed Software may include any updates or error corrections or documentation relating to the Licensed Software provided to you by NXP under this Agreement. In consideration for NXP allowing you to access the Licensed Software, you are agreeing to be bound by the terms of this Agreement. If you do not agree to all of the terms of this Agreement, do not download, install or copy from GitHub or similar platform, the Licensed Software. If you change your mind later, stop using the Licensed Software and delete all copies of the Licensed Software in your possession or control. Any copies of the Licensed Software that you have already distributed, where permitted, and do not destroy will continue to be governed by this Agreement. Your prior use will also continue to be governed by this Agreement.\n1.\tDEFINITIONS\n\n1.1.\t“Affiliate” means, with respect to a party, any corporation or other legal entity that now or hereafter Controls, is Controlled by or is under common Control with such party; where “Control” means the direct or indirect ownership of greater than fifty percent (50%) of the shares or similar interests entitled to vote for the election of directors or other persons performing similar functions. An entity is considered an Affiliate only so long as such Control exists.\n\n1.2.\t“Authorized System” means either (i) Licensee’s hardware product which incorporates an NXP Product or (ii) Licensee’s software program which is used exclusively in connection with an NXP Product and with which the Licensed Software will be integrated.      \n\n1.3.\t“Derivative Work” means a work based upon one or more pre-existing works.  A work consisting of editorial revisions, annotations, elaborations, or other modifications which, as a whole, represent an original work of authorship, is a Derivative Work.\n\n1.4.\t“Intellectual Property Rights” means any and all rights under statute, common law or equity in and under copyrights, trade secrets, and patents (including utility models), and analogous rights throughout the world, including any applications for and the right to apply for, any of the foregoing.\n\n1.5.\t“NXP Product” means a hardware product (e.g., a microprocessor, microcontroller, sensor or digital signal processor) and/or services (e.g., cloud platform services) supplied directly or indirectly from NXP or an NXP Affiliate, unless there is a product specified in the Software Content Register, in which case this definition is limited to such product.\n\n1.6.\t“Software Content Register” means the documentation which may accompany the Licensed Software which identifies the contents of the Licensed Software. \n\n2.\tLICENSE GRANT.  \n\n2.1.\tStandard License.  Subject to the terms and conditions of this Agreement, NXP grants you a worldwide, personal, non-transferable, non-exclusive, non-sublicensable license, solely for the development of an Authorized System:\n\n(a)\tto use and reproduce the Licensed Software (and its Derivative Works prepared under the license in Section 2.1(b)) solely for use in combination with a NXP Product;\n\n(b)\tto prepare Derivative Works of the Licensed Software solely for use in combination with a NXP Product;\n\n(c)\tto manufacture (or have manufactured), distribute, and market object code of the Licensed Software (and its Derivative Works prepared under the license in 2.2(b)) only as part of, or embedded within, Authorized Systems and not on a standalone basis;\n\n(d)\tto copy and distribute as needed, solely in connection with an Authorized System, NXP information provided as part of the Licensed Software for the purpose of maintaining and supporting Authorized Systems which use the Licensed Software; and\n\n(e)\tto distribute the Licensed Software (and its Derivative Works prepared under the license in 2.1(b)) in a source code form on a standalone basis using any means of distribution including GitHub or similar platform, for use with Authorized Systems, provided that you provide every recipient of the License Software a copy of this Agreement, conspicuously  indicate that the Licensed Software is provided under this Agreement, and assure that the recipient understands that by receiving or using the Licensed Software it has entered into this Agreement with NXP.  You are responsible for any violation of this Agreement by anyone who received source code of the Licensed Software from you.\n\n2.2.\tYou may use subcontractors to exercise your rights under Section 2.1, if any, so long as you have an agreement in place with the subcontractor containing restrictions no less stringent than those contained in this Agreement. You will remain liable for your subcontractors’ adherence to the terms of this Agreement and for any and all acts and omissions of such subcontractors with respect to this Agreement and the Licensed Software.\n \n3.\tLICENSE LIMITATIONS AND RESTRICTIONS.  \n\n3.1.\tThe licenses granted above in Section 2 only extend to NXP Intellectual Property Rights that would be infringed by the unmodified Licensed Software prior to your preparation of any Derivative Work.\n\n3.2.\tThe Licensed Software is licensed to you, not sold. Title to Licensed Software delivered hereunder remains vested in NXP or NXP’s licensor and cannot be assigned or transferred. You are expressly forbidden from selling or otherwise distributing the Licensed Software, or any portion thereof, except as expressly permitted herein. This Agreement does not grant to you any implied rights under any NXP or third-party Intellectual Property Rights.\n\n3.3.\tYou may not translate, reverse engineer, decompile, or disassemble the Licensed Software except to the extent applicable law specifically prohibits such restriction. You must prohibit your subcontractors or customers from translating, reverse engineering, decompiling, or disassembling the Licensed Software except to the extent applicable law specifically prohibits such restriction.\n\n3.4.\tYou must reproduce any and all of NXP’s (or its third-party licensor’s) copyright notices and other proprietary legends on copies of Licensed Software.  \n\n3.5.\tIf you distribute the Licensed Software to the United States Government, then the Licensed Software is “restricted computer software” and is subject to FAR 52.227-19.   \n\n3.6.\tYou grant to NXP a non-exclusive, non-transferable, irrevocable, perpetual, worldwide, royalty-free, sub-licensable license under your Intellectual Property Rights to use without restriction and for any purpose any suggestion, comment or other feedback related to the Licensed Software (including, but not limited to, error corrections and bug fixes).\n\n3.7.\tYou will not take or fail to take any action that could subject the Licensed Software to an Excluded License. An Excluded License means any license that requires, as a condition of use, modification or distribution of software subject to the Excluded License, that such software or other software combined and/or distributed with the software be (i) disclosed or distributed in source code form; (ii) licensed for the purpose of making Derivative Works; or (iii) redistributable at no charge. \n\n3.8.\tYou may not publish or distribute reports associated with the use of the Licensed Software to anyone other than NXP.  You may advise NXP of any results obtained from your use of the Licensed Software, including any problems or suggested improvements thereof, and NXP retains the right to use such results and related information in any manner it deems appropriate.\n\n4.\tOPEN SOURCE.  Open-source software included in the Licensed Software is not licensed under the terms of this Agreement but is instead licensed under the terms of the applicable open-source license(s), such as the BSD License, Apache License or the GNU Lesser General Public License. Your use of the open-source software is subject to the terms of each applicable license. You must agree to the terms of each applicable license, or you cannot use the open-source software.  \n \n5.\tINTELLECTUAL PROPERTY RIGHTS.\n\n5.1.\tUpon request, you must provide NXP the source code of any derivative of the Licensed Software.\n\n5.2.\tUnless prohibited by law, the following paragraph shall apply.  Your modifications to the Licensed Software, and all intellectual property rights associated with, and title thereto, will be the property of NXP.  You agree to assign all, and hereby do assign all rights, title, and interest to any such modifications to the Licensed Software to NXP and agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.  Further, you agree to waive all moral rights relating to your modifications to the Licensed Software, including, without limitation, all rights of identification of authorship and all rights of approval, restriction, or limitation on use or subsequent modification.  Notwithstanding the foregoing, you will have the license rights granted in Section 2 hereto to any such modifications.\n\n5.3.\tOtherwise, you agree to grant an irrevocable, worldwide, and perpetual license to NXP to make, have made, use, sell, offer to sell, import, commercialize, sublicense and reproduce your modifications or derivative works to the Licensed Software without any payment to you. You agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.\n\n6.\tESSENTIAL PATENTS.    NXP has no obligation to identify or obtain any license to any Intellectual Property Right of a third-party that may be necessary for use in connection with technology that is incorporated into the Authorized System (whether or not as part of the Licensed Software).\n\n7.\tTERM AND TERMINATION.   This Agreement will remain in effect unless terminated as provided in this Section.\n\n7.1.\tYou may terminate this Agreement immediately by deleting the Licensed Software and all copies thereof.\n\n7.2.\tEither party may terminate this Agreement if the other party is in default of any of the terms and conditions of this Agreement, and termination is effective if the defaulting party fails to correct such default within 30 days after written notice thereof by the non-defaulting party to the defaulting party at the address below.\n\n7.3.\tNotwithstanding the foregoing, NXP may terminate this Agreement immediately upon written notice if you:  become bankrupt, insolvent, or file a petition for bankruptcy or insolvency; make an assignment for the benefit of its creditors; enter proceedings for winding up or dissolution; are dissolved; or are nationalized or become subject to the expropriation of all or substantially all of your business or assets.\n\n7.4.\tUpon termination of this Agreement, all licenses granted under Section 2 will expire. \n\n7.5.\tAfter termination of this Agreement by either party you will destroy all parts of Licensed Software and its Derivative Works (if any) and will provide to NXP a statement certifying the same.\n\n7.6.\tNotwithstanding the termination of this Agreement for any reason, the terms of Sections 1 and 3 through 24 will survive.  \n\n8.\tSUPPORT.  NXP is not obligated to provide any support, upgrades or new releases of the Licensed Software under this Agreement. If you wish, you may contact NXP and report problems and provide suggestions regarding the Licensed Software. NXP has no obligation to respond to such a problem report or suggestion. NXP may make changes to the Licensed Software at any time, without any obligation to notify or provide updated versions of the Licensed Software to you.\n9.\tNO WARRANTY.  To the maximum extent permitted by law, NXP expressly disclaims any warranty for the Licensed Software. The Licensed Software is provided “AS IS”, without warranty of any kind, either express or implied, including without limitation the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. You assume the entire risk arising out of the use or performance of the licensed software, or any systems you design using the licensed software (if any).\n\n10.\tINDEMNITY. You agree to fully defend and indemnify NXP from all claims, liabilities, and costs (including reasonable attorney’s fees) related to (1) your use (including your subcontractor’s or distributee’s use) of the Licensed Software or (2) your violation of the terms and conditions of this Agreement.\n\n11.\tLIMITATION OF LIABILITY.  EXCLUDING LIABILITY FOR A BREACH OF SECTION 2 (LICENSE GRANTS), SECTION 3 (LICENSE LIMITATIONS AND RESTRICTIONS), OR CLAIMS UNDER SECTION 10 (INDEMNITY), IN NO EVENT WILL EITHER PARTY BE LIABLE, WHETHER IN CONTRACT, TORT, OR OTHERWISE, FOR ANY INCIDENTAL, SPECIAL, INDIRECT, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING, BUT NOT LIMITED TO, DAMAGES FOR ANY LOSS OF USE, LOSS OF TIME, INCONVENIENCE, COMMERCIAL LOSS, OR LOST PROFITS, SAVINGS, OR REVENUES, TO THE FULL EXTENT SUCH MAY BE DISCLAIMED BY LAW. NXP’S TOTAL LIABILITY FOR ALL COSTS, DAMAGES, CLAIMS, OR LOSSES WHATSOEVER ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT OR PRODUCT(S) SUPPLIED UNDER THIS AGREEMENT IS LIMITED TO THE AGGREGATE AMOUNT PAID BY YOU TO NXP IN CONNECTION WITH THE LICENSED SOFTWARE PROVIDED UNDER THIS AGREEMENT TO WHICH LOSSES OR DAMAGES ARE CLAIMED.\n\n12.\tEXPORT COMPLIANCE. Each party shall comply with all applicable export and import control laws and regulations including but not limited to the US Export Administration Regulation (including restrictions on certain military end uses and military end users as specified in Section 15 C.F.R. § 744.21 and prohibited party lists issued by other federal governments), Catch-all regulations and all national and international embargoes. Each party further agrees that it will not knowingly transfer, divert, export or re-export, directly or indirectly, any product, software, including software source code, or technology restricted by such regulations or by other applicable national regulations, received from the other party under this Agreement, or any direct product of such software or technical data to any person, firm, entity, country or destination to which such transfer, diversion, export or re-export is restricted or prohibited, without obtaining prior written authorization from the applicable competent government authorities to the extent required by those laws.\n \n13.\tGOVERNMENT CONTRACT COMPLIANCE\n\n13.1.\tIf you sell Authorized Systems directly to any government or public entity, including U.S., state, local, foreign or international governments or public entities, or indirectly via a prime contractor or subcontractor of such governments or entities, NXP makes no representations, certifications, or warranties whatsoever about compliance with government or public entity acquisition statutes or regulations, including, without limitation, statutes or regulations that may relate to pricing, quality, origin or content.\n\n13.2.\tThe Licensed Software has been developed at private expense and is a “Commercial Item” as defined in 48 C.F.R. Section 2.101, consisting of “Commercial Computer Software”, and/or “Commercial Computer Software Documentation,” as such terms are used in 48 C.F.R. Section 12.212 (or 48 C.F.R. Section 227.7202, as applicable) and may only be licensed to or shared with U.S. Government end users in object code form as part of, or embedded within, Authorized Systems. Any agreement pursuant to which you share the Licensed Software will include a provision that reiterates the limitations of this document and requires all sub-agreements to similarly contain such limitations. \n\n14.\tCRITICAL APPLICATIONS.  In some cases, NXP may promote certain software for use in the development of, or for incorporation into, products or services (a) used in applications requiring fail-safe performance or (b) in which failure could lead to death, personal injury, or severe physical or environmental damage (these products and services are referred to as “Critical Applications”). NXP’s goal is to educate customers so that they can design their own end-product solutions to meet applicable functional safety standards and requirements. Licensee makes the ultimate design decisions regarding its products and is solely responsible for compliance with all legal, regulatory, safety, and security related requirements concerning its products, regardless of any information or support that may be provided by NXP. As such, Licensee assumes all risk related to use of the Licensed Software in Critical Applications and NXP SHALL NOT BE LIABLE FOR ANY SUCH USE IN CRITICAL APPLICATIONS BY LICENSEE. Accordingly, Licensee will indemnify and hold NXP harmless from any claims, liabilities, damages and associated costs and expenses (including attorneys’ fees) that NXP may incur related to Licensee’s incorporation of the Licensed Software in a Critical Application.\n\n15.\tCHOICE OF LAW; VENUE.  This Agreement will be governed by, construed, and enforced in accordance with the laws of The Netherlands, without regard to conflicts of laws principles, will apply to all matters relating to this Agreement or the Licensed Software, and you agree that any litigation will be subject to the exclusive jurisdiction of the courts of Amsterdam, The Netherlands. The United Nations Convention on Contracts for the International Sale of Goods will not apply to this document. \n\n16.\tTRADEMARKS.  You are not authorized to use any NXP trademarks, brand names, or logos.\n\n17.\tENTIRE AGREEMENT.  This Agreement constitutes the entire agreement between you and NXP regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in written form, signed by you and NXP.\n\n\n18.\tSEVERABILITY.  If any provision of this Agreement is held for any reason to be invalid or unenforceable, then the remaining provisions of this Agreement will be unimpaired and, unless a modification or replacement of the invalid or unenforceable provision is further held to deprive you or NXP of a material benefit, in which case the Agreement will immediately terminate, the invalid or unenforceable provision will be replaced with a provision that is valid and enforceable and that comes closest to the intention underlying the invalid or unenforceable provision.\n\n19.\tNO WAIVER.  The waiver by NXP of any breach of any provision of this Agreement will not operate or be construed as a waiver of any other or a subsequent breach of the same or a different provision.\n\n20.\tAUDIT.  You will keep full, clear and accurate records with respect to your compliance with the limited license rights granted under this Agreement for three years following expiration or termination of this Agreement. NXP will have the right, either itself or through an independent certified public accountant to examine and audit, at NXP’s expense, not more than once a year, and during normal business hours, all such records that may bear upon your compliance with the limited license rights granted above. You must make prompt adjustment to compensate for any errors and/or omissions disclosed by such examination or audit.\n\n21.\tNOTICES.  All notices and communications under this Agreement will be made in writing, and will be effective when received at the following addresses: \nNXP:\t\nNXP B.V.\nHigh Tech Campus 60\n5656 AG Eindhoven\nThe Netherlands\nATTN: Legal Department\n \t         \nYou:\t\nThe address of company headquarters will be used for a company Licensee or the address of an individual for an individual Licensee.\n\n22.\tRELATIONSHIP OF THE PARTIES.  The parties are independent contractors. Nothing in this Agreement will be construed to create any partnership, joint venture, or similar relationship. Neither party is authorized to bind the other to any obligations with third parties.\n\n23.\tSUCCESSION AND ASSIGNMENT.   This Agreement will be binding upon and inure to the benefit of the parties and their permitted successors and assigns.  You may not assign this Agreement, or any part of this Agreement, without the prior written approval of NXP, which approval will not be unreasonably withheld or delayed. NXP may assign this Agreement, or any part of this Agreement, in its sole discretion. \n\n24.\tPRIVACY. By agreeing to this Agreement and/or utilizing the Licensed Software, Licensee consents to use of certain personal information, including but not limited to name, email address, and location, for the purpose of NXP’s internal analysis regarding future software offerings.  NXP’s complete Privacy Statement can be found at: https://www.nxp.com/company/our-company/about-nxp/privacy-statement:PRIVACYPRACTICES.\n",
      "name": "LA_OPT_Online Code Hosting NXP_Software_License - v1.2 October 2023"
    }
  ],
  "documentNamespace": "https://nxp.com/spdx/9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
  "packages": [
    {
      "SPDXID": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "name": "mcux-component",
      "versionInfo": "v25.09.00-pvw2",
      "licenseConcluded": "(LicenseRef-bf9973bb-8090-4f76-adea-710fd5e3efbc)",
      "licenseDeclared": "(LicenseRef-bf9973bb-8090-4f76-adea-710fd5e3efbc)",
      "downloadLocation": "https://github.com/nxp-mcuxpresso/mcux-component",
      "originator": "Organization: NXP",
      "supplier": "NOASSERTION",
      "externalRefs": [],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-1ffe6406-89b4-415b-9902-0d6549960424",
      "name": "ARM-software/CMSIS_6",
      "versionInfo": "v6.1.0",
      "licenseConcluded": "Apache-2.0",
      "licenseDeclared": "Apache-2.0",
      "downloadLocation": "NOASSERTION",
      "originator": "Organization: ARM-software/CMSIS_6",
      "supplier": "NOASSERTION",
      "externalRefs": [],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-c0462ace-1e31-401e-a07a-cf435d70154e",
      "name": "eembc/coremark",
      "versionInfo": "v1.01",
      "licenseConcluded": "Apache-2.0",
      "licenseDeclared": "Apache-2.0",
      "downloadLocation": "NOASSERTION",
      "originator": "Organization: eembc/coremark",
      "supplier": "NOASSERTION",
      "externalRefs": [],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-a95a3846-e42b-43a1-a491-03808cb29b9f",
      "name": "FreeRTOS Real Time Kernel",
      "versionInfo": "202111.00",
      "licenseConcluded": "MIT",
      "licenseDeclared": "MIT",
      "homepage": "https://sourceforge.net/projects/freertos",
      "downloadLocation": "NOASSERTION",
      "originator": "Organization: FreeRTOS Real Time Kernel",
      "supplier": "NOASSERTION",
      "externalRefs": [
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:a:amazon:freertos:202111.00:*:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        },
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:o:amazon:freertos:202111.00:*:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        },
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:o:amazon:freertos+fat:202111.00:*:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        }
      ],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-701c0fa8-72be-4edf-9707-8ac585b08d10",
      "name": "memfault/memfault-firmware-sdk",
      "versionInfo": "1.20.0",
      "licenseConcluded": "LicenseRef-b99d132e-c7cd-453d-9fd8-f47eed9b7670",
      "licenseDeclared": "LicenseRef-3eca8fb9-fca4-4b49-b4bd-189ba8efd691",
      "downloadLocation": "NOASSERTION",
      "originator": "Organization: memfault",
      "supplier": "NOASSERTION",
      "externalRefs": [
        {
          "referenceCategory": "OTHER",
          "referenceLocator": "1f617973-5fb8-424b-8c29-ca558e2507a4",
          "referenceType": "BlackDuck-ComponentOrigin"
        },
        {
          "referenceCategory": "PACKAGE-MANAGER",
          "referenceLocator": "pkg:github/memfault/memfault-firmware-sdk@1.20.0",
          "referenceType": "purl"
        }
      ],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-7d1f6cb3-3384-4373-a710-e04d7d822b22",
      "name": "Segger J-Link drivers",
      "versionInfo": "V8.10c",
      "licenseConcluded": "LicenseRef-68ae68ac-8cc8-4eaf-a7f4-998c2194f58d",
      "licenseDeclared": "LicenseRef-68ae68ac-8cc8-4eaf-a7f4-998c2194f58d",
      "homepage": "https://www.segger.com/downloads/jlink/",
      "downloadLocation": "https://www.segger.com/downloads/jlink/",
      "originator": "Organization: Segger J-Link drivers",
      "supplier": "NOASSERTION",
      "externalRefs": [],
      "filesAnalyzed": false
    },
    {
      "SPDXID": "SPDXRef-package-58bffbb3-b8df-4b99-b0a7-52d8efd623b8",
      "name": "zephyr",
      "versionInfo": "v4.0.0-rc3",
      "licenseConcluded": "Apache-2.0",
      "licenseDeclared": "Apache-2.0",
      "homepage": "https://zephyrproject.org/doc",
      "downloadLocation": "NOASSERTION",
      "originator": "Organization: zephyrproject-rtos",
      "supplier": "NOASSERTION",
      "externalRefs": [
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:a:zephyrproject_rtos:zephyr:4.0.0:rc3:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        },
        {
          "referenceCategory": "PACKAGE-MANAGER",
          "referenceLocator": "pkg:github/zephyrproject-rtos/zephyr@v4.0.0-rc3",
          "referenceType": "purl"
        },
        {
          "referenceCategory": "OTHER",
          "referenceLocator": "1fb513c1-5421-41be-888b-c95c16f733cb",
          "referenceType": "BlackDuck-ComponentOrigin"
        },
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:o:zephyrproject:zephyr:4.0.0:rc3:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        },
        {
          "referenceCategory": "SECURITY",
          "referenceLocator": "cpe:2.3:a:zephyrproject:zephyr:4.0.0:rc3:*:*:*:*:*:*",
          "referenceType": "cpe23Type"
        }
      ],
      "filesAnalyzed": false
    }
  ],
  "relationships": [
    {
      "spdxElementId": "SPDXRef-DOCUMENT",
      "relationshipType": "DESCRIBES",
      "relatedSpdxElement": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-58bffbb3-b8df-4b99-b0a7-52d8efd623b8"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "DYNAMIC_LINK",
      "relatedSpdxElement": "SPDXRef-package-701c0fa8-72be-4edf-9707-8ac585b08d10"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "DYNAMIC_LINK",
      "relatedSpdxElement": "SPDXRef-package-c0462ace-1e31-401e-a07a-cf435d70154e"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-c0462ace-1e31-401e-a07a-cf435d70154e"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-701c0fa8-72be-4edf-9707-8ac585b08d10"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-a95a3846-e42b-43a1-a491-03808cb29b9f"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "DYNAMIC_LINK",
      "relatedSpdxElement": "SPDXRef-package-7d1f6cb3-3384-4373-a710-e04d7d822b22"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-7d1f6cb3-3384-4373-a710-e04d7d822b22"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "DYNAMIC_LINK",
      "relatedSpdxElement": "SPDXRef-package-a95a3846-e42b-43a1-a491-03808cb29b9f"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "DYNAMIC_LINK",
      "relatedSpdxElement": "SPDXRef-package-1ffe6406-89b4-415b-9902-0d6549960424"
    },
    {
      "spdxElementId": "SPDXRef-package-9c5bafcc-9c70-44ec-8a89-bc1079c23e6f",
      "relationshipType": "CONTAINS",
      "relatedSpdxElement": "SPDXRef-package-1ffe6406-89b4-415b-9902-0d6549960424"
    }
  ]
}